CSI API ETABS v1
cPropArea.GetNameList Method
 Retrieves the names of all defined area properties of the specified type.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetNameList(
	ref int NumberNames,
	ref string[] MyName,
	int PropType = 0
)
Function GetNameList (
	ByRef NumberNames As Integer,
	ByRef MyName As String(),
	Optional PropType As Integer = 0
) As Integer
Dim instance As cPropArea
Dim NumberNames As Integer
Dim MyName As String()
Dim PropType As Integer
Dim returnValue As Integer
returnValue = instance.GetNameList(NumberNames,
	MyName, PropType)
int GetNameList(
	int% NumberNames,
	array<String^>^% MyName,
	int PropType = 0
)
abstract GetNameList :
        NumberNames : int byref *
        MyName : string[] byref *
        ?PropType : int
(* Defaults:
        let _PropType = defaultArg PropType 0
*)
-> int
Parameters
NumberNames
Type: System.Int32
The number of area property names retrieved by the program.
MyName
Type: System.String[]
One-dimensional array of area property names. The MyName array is created as a dynamic, zero-based, array by the API user:
Dim MyName() as String
 The array is dimensioned to (NumberNames - 1) inside the program, filled with the names, and returned to the API user.
PropType (Optional)
Type: System.Int32
This optional value is 0, 1, 2 or 3, indicating the type of area properties included in the name list.
Value | Type
0 | All
1 | Shell
2 | Plane
3 | Asolid
Return Value
Type: Int32
Returns zero if the names are successfully retrieved; otherwise it returns nonzero
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim i As Integer
       Dim NumberNames As Integer
       Dim MyName() As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get area property names
       ret = SapModel.PropArea.GetNameList(NumberNames, MyName)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropArea Interface
ETABSv1 Namespace